#pragma once

/****************************************************************
 * Include
 ****************************************************************/
#include <SimpleMath.h>
#include "define.h"


/****************************************************************
 * using namespace
 ****************************************************************/
using namespace DirectX::SimpleMath;


/****************************************************************
 * Cameraクラス
 ****************************************************************/
class Camera {

private:

	Vector3 eyePos;     /* 視線の位置 */
	Vector3 targetPos;  /* 目標点の位置 */
	Vector3 upward;     /* カメラの上方向ベクトル */

	float fovY;         /* カメラの視野角 */
	float Clip_near;    /* クリップ距離（近）*/
	float Clip_far;     /* クリップ距離（遠）*/
	float aspect;       /* ウィンドウのアスペクト比 */

public:

	Camera();

	~Camera();



	/****************************************************************
	 * カメラ座標の取得
	 ****************************************************************/
	Vector3 GetEyePos() const;

	Vector3 GetTargetPos() const;

	Vector3 GetUpWard() const;


};

