#pragma once

/****************************************************************
 * Include
 ****************************************************************/
#include <d3d12.h>
#include <dxgi1_4.h>
#include <cstdint>
#include "ComPtr.h"


/****************************************************************
 * バッファ識別列挙体
 ****************************************************************/
enum BufferType {

	CBV,   /* 定数バッファ */
	SRV,   /* シェーダーリソースバッファ */
	UAV    /* アンオーダーアクセスバッファ */
};


/****************************************************************
 * DescriptorManager クラス
 ****************************************************************/
class DescriptorManager {

private:

	static const uint32_t _FrameCount = 2;

	
	/****************************************************************
	 * リソース（バッファ・ディスクリプタ）
	 ****************************************************************/
	ComPtr<ID3D12Resource>  m_pRTB[_FrameCount];  /* レンダーターゲットのバッファ（カラーターゲットバッファ）*/
	ComPtr<ID3D12Resource>  m_pDSB;               /* 深度ステンシルバッファ */
	
	
	/****************************************************************
	 * ディスクリプタヒープ
	 ****************************************************************/
	ComPtr<ID3D12DescriptorHeap> m_pHeapRTV;          /* レンダーターゲットビュー用 */
	ComPtr<ID3D12DescriptorHeap> m_pHeapDSV;          /* 深度ステンシルビュー用 */
	ComPtr<ID3D12DescriptorHeap> m_pHeapCBV_SRV_UAV;  /* CBV・SRV・UAV用 */


	/****************************************************************
	 * ビュー
	 ****************************************************************/
	D3D12_CPU_DESCRIPTOR_HANDLE  m_HandleRTV[_FrameCount];  /* RTV（CPUハンドルのみ）*/
	D3D12_CPU_DESCRIPTOR_HANDLE  m_HandleDSV;               /* DSV（CPUハンドルのみ）*/


public:

	DescriptorManager();

	~DescriptorManager();


	/****************************************************************
	 * RTVの作成（ディスクリプターヒープ）
	 ****************************************************************/
	bool CreateRTV(ID3D12Device* pDevice, IDXGISwapChain3* pSwapChain);


	/****************************************************************
	 * DSVの作成（ディスクリプターヒープ）
	 ****************************************************************/
	bool CreateDSV(ID3D12Device* pDevice, uint32_t Width, uint32_t Height);


	/****************************************************************
	 * Descの取得
	 ****************************************************************/



	/****************************************************************
	 * CPUハンドルの取得
	 ****************************************************************/
	D3D12_CPU_DESCRIPTOR_HANDLE GetCPUHandle_RTV(const uint32_t FrameIndex) const;    /* RTV */
	D3D12_CPU_DESCRIPTOR_HANDLE GetCPUHandle_DSV() const;                             /* DSV */


	/****************************************************************
	 * リソースの取得
	 ****************************************************************/
	ID3D12Resource* GetResource_RTB(const uint32_t FrameIndex) const
	{ return m_pRTB[FrameIndex].Get(); };


	/****************************************************************
	 * RTV ディスクリプターヒープの破棄
	 ****************************************************************/
	void TermRTV();



	/****************************************************************
	 * DSV ディスクリプターヒープの破棄
	 ****************************************************************/
	void TermDSV();


};