#pragma once

/****************************************************************
 * Include
 ****************************************************************/
#include <string>


/****************************************************************
 * マルチバイトからワイド文字への変換
 ****************************************************************/
std::wstring MbstrToWstr(const char* mbstr) {

	size_t size = 0;
	wchar_t wstr[256] = L"";
	mbstowcs_s(&size, wstr, _countof(wstr), mbstr, 256);  // ワイド文字に変換

	return wstr;
}