#pragma once

/*****************************************************************
 * Include
 *****************************************************************/
#include <windows.h>
#undef min
#undef max

#include <cstdint>


/*****************************************************************
 * Window クラス
 *****************************************************************/
class Window {

private:

	HINSTANCE m_hInst;        /* インスタンスハンドル（このプログラム自体のインスタンス） */
	HWND      m_hWnd;         /* ウィンドウのインスタンス */
	uint32_t  m_Width;        /* ウィンドウの横幅 */
	uint32_t  m_Height;       /* ウィンドウの高さ */
	LPCWSTR   m_windowTitle;  /* ウィンドウの名前 */

public:

	Window();

	~Window();

	/*****************************************************************
	 * ウィンドウの初期化
	 *****************************************************************/
	bool InitWindow(uint32_t width, uint32_t height, LPCWSTR title);



	/*****************************************************************
	 * ウィンドウの破棄
	 *****************************************************************/
	void TermWindow();


	/*****************************************************************
	 * インスタンスやウィンドウ設定の取得処理
	 *****************************************************************/
	const HINSTANCE Get_hInst();
	const HWND      Get_hWnd();
	const uint32_t  Get_WndWidth();
	const uint32_t  Get_WndHeight();


};


/*****************************************************************
 * ウィンドウプロシージャ
 *****************************************************************/
//LRESULT CALLBACK WndProc(HWND hwnd, UINT msg, WPARAM wp, LPARAM lp);