#pragma once
/****************************************************************
 * Include
 ****************************************************************/
#include <windows.h>
#undef max
#undef min

#include <cstdint>
#include <cassert>
#include <cmath>
#include <d3d12.h>
#include <dxgi1_4.h>
#include <wrl.h>
#include <DirectXMath.h>
#include <d3dcompiler.h>
#include "ResourceUploadBatch.h"
#include "DDSTextureLoader.h"
#include "VertexTypes.h"
#include "FileUtil.h"


/****************************************************************
 * Linker（ライブラリの指定）
 ****************************************************************/
#pragma comment( lib, "d3d12.lib" )
#pragma comment( lib, "dxgi.lib" )
#pragma comment( lib, "dxguid.lib" )
#pragma comment( lib, "d3dcompiler.lib" )


/****************************************************************
 * ComPtr（スマートポインタ）
 ****************************************************************/
using namespace Microsoft::WRL;


/****************************************************************
 * 頂点 構造体
 ****************************************************************/
struct Vertex {

	DirectX::XMFLOAT3 Position;  /* 位置座標 */
	DirectX::XMFLOAT4 Color;     /* 頂点の色 */
};


/****************************************************************
 *  Transform 構造体 (メモリアライメント 256 Byte)
 ****************************************************************/
struct alignas(256) Transform {

	DirectX::XMMATRIX World;       /* ワールド行列 */
	DirectX::XMMATRIX View;        /* ビュー行列 */
	DirectX::XMMATRIX Projection;  /* 射影行列 */
};

/****************************************************************
 * テクスチャ　構造体
 ****************************************************************/
struct Texture {

	ComPtr<ID3D12Resource>      pResource;  /* リソース */
	D3D12_CPU_DESCRIPTOR_HANDLE HandleCPU;  /* CPUのディスクリプタに対するハンドル */
	D3D12_GPU_DESCRIPTOR_HANDLE HandleGPU;  /* GPUのディスクリプタに対するハンドル */
};


/****************************************************************
 * 定数バッファビュー 構造体
 ****************************************************************/
template<typename T>
struct ConstantBufferView {

	D3D12_CONSTANT_BUFFER_VIEW_DESC CBVDesc;    /* 定数バッファの設定 */
	D3D12_CPU_DESCRIPTOR_HANDLE     HandleCPU;  /* CPUディスクリプタハンドル */
	D3D12_GPU_DESCRIPTOR_HANDLE     HandleGPU;  /* GPUディスクリプタハンドル */
	T*                              pBuffer;    /* バッファ先頭を指すポインタ */
};


/****************************************************************
 * App Class
 ****************************************************************/
class App {

private:

	/*****************************************************************
	 * フレームバッファ数（画面の数・静的に宣言）
	 *****************************************************************/
	static const uint32_t FrameCount = 2;


	/*****************************************************************
	 * ウィンドウ用メンバ変数 
	 *****************************************************************/
	
	HINSTANCE m_hInst;        /* インスタンスハンドル（このプログラム自体のインスタンス） */
	HWND      m_hWnd;         /* ウィンドウのインスタンス */
	uint32_t  m_Width;        /* ウィンドウの横幅 */
	uint32_t  m_Height;       /* ウィンドウの高さ */
	LPCWSTR   m_windowTitle;  /* ウィンドウの名前 */


	/*****************************************************************
	 * Direct3D用のメンバ変数
	 *****************************************************************/

	ComPtr<ID3D12Device>               m_pDevice;                    /* GPUデバイス */
	ComPtr<ID3D12CommandQueue>         m_pCmdQueue;                  /* コマンドキュー */
	ComPtr<IDXGISwapChain3>            m_pSwapChain;                 /* スワップチェイン（SwapChain3でフレームバッファ番号を取得できる） */
	ComPtr<ID3D12Resource>             m_pColorBuffer[FrameCount];   /* カラーバッファ（バックバッファ）、フレーム数分必要（今回はダブルバッファリングなので２個） */
	ComPtr<ID3D12CommandAllocator>     m_pCmdAllocator[FrameCount];  /* コマンドアロケーター、フレーム数分必要（今回はダブルバッファリングなので２個） */
	ComPtr<ID3D12GraphicsCommandList>  m_pCmdList;                   /* コマンドリスト */
	ComPtr<ID3D12DescriptorHeap>       m_pHeapRTV;                   /* レンダーターゲットビュー用ディスクリプタヒープ */
	ComPtr<ID3D12Fence>                m_pFence;                     /* フェンス */


	HANDLE                       m_FenceEvent;                 /* フェンスイベント（ウィンドウズの OSの機構を利用）*/
	uint64_t                     m_FenceCounter[FrameCount];   /* フェンスカウンター（この値がインクリメントされたらGPU処理が完了）*/
	uint32_t                     m_FrameIndex;                 /* 表示しているフレームバッファの番号 */
	D3D12_CPU_DESCRIPTOR_HANDLE  m_HandleRTV[FrameCount];      /* レンダーターゲットビュー用CPUディスクリプターハンドル */


	/*****************************************************************
	 * 描画用インターフェイスのメンバ変数
	 *****************************************************************/
	ComPtr<ID3D12DescriptorHeap> m_pHeapCBV_SRV_UAV;    /* ディスクリプタヒープ（定数バッファビュー・シェーダーリソースバッファビュー・アンオーダーアクセスビュー） */
	ComPtr<ID3D12Resource>       m_pVB;                 /* 頂点バッファ */
	ComPtr<ID3D12Resource>       m_pIB;                 /* インデックスバッファ */
	ComPtr<ID3D12Resource>       m_pDSB;                /* 深度ステンシルバッファ */
	ComPtr<ID3D12Resource>       m_pCB[FrameCount * 2]; /* 定数バッファ（バックバッファの数×モデルの数分必要）*/
	ComPtr<ID3D12DescriptorHeap> m_pHeapDSV;            /* 深度ステンシルビュー用のディスクリプタヒープ */
	ComPtr<ID3D12RootSignature>  m_pRootSignature;      /* ルートシグネチャ */
	ComPtr<ID3D12PipelineState>  m_pPSO;                /* パイプラインステート */
	

	D3D12_VERTEX_BUFFER_VIEW      m_VBV;                  /* 頂点バッファビュー（１モデルの頂点の塊に関する情報・モデルの数分必要）*/
	D3D12_INDEX_BUFFER_VIEW       m_IBV;                  /* インデックスバッファビュー */
	ConstantBufferView<Transform> m_CBV[FrameCount * 2];  /* 定数バッファビュー（バックバッファの数×モデルの数分必要）*/
	Texture                       m_Texture;              /* テクスチャのデータを保存 */
	D3D12_CPU_DESCRIPTOR_HANDLE   m_HandleDSV;            /* 深度ステンシルバッファビュー用のハンドル（ディスクリプタヒープの先頭ポインタ）*/
	D3D12_VIEWPORT                m_Viewport;             /* ビューポート */
	D3D12_RECT                    m_Scissor;              /* シザー矩形 */


public:


	App(uint32_t width, uint32_t height, LPCWSTR title);

	~App();


	/*****************************************************************
	 * アプリケーションの実行処理
	 *****************************************************************/
	void Run();


private:

	/*****************************************************************
	 * アプリ全体の初期化処理
	 *****************************************************************/
	bool InitApp();


	/*****************************************************************
	 * ウィンドウの初期化
	 *****************************************************************/
	bool InitWindow();


	/*****************************************************************
	 * Direct3Dの初期化
	 *****************************************************************/
	bool InitDirect3D();


	/*****************************************************************
	 * 描画用インターフェイスの初期化
	 *****************************************************************/
	bool OnInit();


	/*****************************************************************
	 * メインループ
	 *****************************************************************/
	void MainLoop();


	/*****************************************************************
	 * 更新処理
	 *****************************************************************/
	void Update();


	/*****************************************************************
	 * 描画処理
	 *****************************************************************/
	void Render();

	
	/*****************************************************************
	 * 画面の表示処理・次フレームの準備処理
	 *****************************************************************/
	void Present(uint32_t interval);


	/*****************************************************************
	 * GPUの描画完了を待機する処理
	 *****************************************************************/
	void WaitGPU();


	/*****************************************************************
	 * アプリケーションの破棄
	 *****************************************************************/
	void TermApp();


	/*****************************************************************
	 * ウィンドウの破棄
	 *****************************************************************/
	void TermWindow();


	/*****************************************************************
	 * Direct3Dの破棄
	 *****************************************************************/
	void TermDirect3D();


	/*****************************************************************
	 * 描画用インターフェースの破棄
	 *****************************************************************/
	void OnTerm();


};


/*****************************************************************
 * ウィンドウプロシージャ
 *****************************************************************/
LRESULT CALLBACK WndProc(HWND hwnd, UINT msg, WPARAM wp, LPARAM lp);


/*****************************************************************
 * インターフェースの解放（nullptrであるかを確認したのちに解放） 
 *****************************************************************/
template<typename T>
void SafeRelease(T* ptr);