
/**************************************************************
 * メモリリークのチェック 
 **************************************************************/
#if defined (DEBUG) || defined(_DEBUG)
	#define _CRTDBG_MAP_ALLOC
	#include <crtdbg.h>
#endif


/**************************************************************
 * Include
 **************************************************************/
#include "WinMain.h"
#include "define.h"


/**************************************************************
 * Class
 **************************************************************/
class App;


/**************************************************************
 * メインエントリー
 **************************************************************/
int main() {

	// メモリリークのチェック
#if defined (DEBUG) || defined (_DEBUG)
	_CrtSetDbgFlag(_CRTDBG_ALLOC_MEM_DF | _CRTDBG_LEAK_CHECK_DF);
#endif


	// DirectX12の実行
	App app(WINDOW_WIDTH, WINDOW_HEIGHT, L"DirectX12");
	app.Run();

	return 0;
}